lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/ESP32SPI/esp32_spi_debug.c
#include "esp32_spi_debug.h"
#include "edgewind_units.h"

#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "main.h"
#include "spi.h"
#include "FreeRTOS.h"
#include "semphr.h"
#include "task.h"

extern void ESP_UI_Internal_OnLog(const char *line);

#define ESP32_SPI_MAGIC 0x43505243UL
#define ESP32_SPI_VERSION 0x01U
#define ESP32_SPI_MAX_PAYLOAD 1536U
#define ESP32_SPI_FRAME_SIZE 1564U
#define ESP32_SPI_READY_TIMEOUT_MS 3000U
#define ESP32_SPI_READY_RELEASE_TIMEOUT_MS 20U
#define ESP32_SPI_INTER_TRANSACTION_GUARD_MS 1U
#define ESP32_SPI_XFER_TIMEOUT_MS 300U
#define ESP32_SPI_REPORT_RETRY_ATTEMPTS 5U
#define ESP32_SPI_REPORT_RETRY_BACKOFF_MS 1U
#define ESP32_SPI_STATS_LOG_INTERVAL_MS 10000U
#define ESP32_SPI_DEFAULT_TIMEOUT_MS 3000U
#define ESP32_SPI_WIFI_POLL_INTERVAL_MS 1000U
#define ESP32_SPI_RESULT_PENDING 0xFFFFU
#define ESP32_SPI_LOCK_TIMEOUT_MS 5000U

#ifndef ESP32_SPI_ENABLE_FULL_UPLOAD
#define ESP32_SPI_ENABLE_FULL_UPLOAD 1
#endif

#ifndef ESP32_SPI_LOG_FULL_CHUNKS
#define ESP32_SPI_LOG_FULL_CHUNKS 0
#endif

#ifndef ESP32_SPI_LOG_TX_ACCEPTED
#define ESP32_SPI_LOG_TX_ACCEPTED 0
#endif

#ifndef ESP32_SPI_LOG_RETRYABLE_NACKS
#define ESP32_SPI_LOG_RETRYABLE_NACKS 0
#endif

typedef enum {
    ESP32_MSG_NOOP = 0x00,
    ESP32_MSG_HELLO_REQ = 0x01,
    ESP32_MSG_HELLO_RESP = 0x02,
    ESP32_MSG_SET_DEVICE_CONFIG_REQ = 0x10,
    ESP32_MSG_SET_DEVICE_CONFIG_RESP = 0x11,
    ESP32_MSG_SET_COMM_PARAMS_REQ = 0x12,
    ESP32_MSG_SET_COMM_PARAMS_RESP = 0x13,
    ESP32_MSG_CONNECT_REQ = 0x14,
    ESP32_MSG_CONNECT_RESP = 0x15,
    ESP32_MSG_DISCONNECT_REQ = 0x16,
    ESP32_MSG_DISCONNECT_RESP = 0x17,
    ESP32_MSG_START_REPORT_REQ = 0x18,
    ESP32_MSG_START_REPORT_RESP = 0x19,
    ESP32_MSG_STOP_REPORT_REQ = 0x1A,
    ESP32_MSG_STOP_REPORT_RESP = 0x1B,
    ESP32_MSG_QUERY_STATUS_REQ = 0x1C,
    ESP32_MSG_STATUS_RESP = 0x1D,
    ESP32_MSG_PING_REQ = 0x1E,
    ESP32_MSG_PING_RESP = 0x1F,
    ESP32_MSG_CLOUD_CONNECT_REQ = 0x20,
    ESP32_MSG_CLOUD_CONNECT_RESP = 0x21,
    ESP32_MSG_REGISTER_REQ = 0x22,
    ESP32_MSG_REGISTER_RESP = 0x23,
    ESP32_MSG_REPORT_SUMMARY = 0x30,
    ESP32_MSG_REPORT_FULL_BEGIN = 0x31,
    ESP32_MSG_REPORT_FULL_WAVE_CHUNK = 0x32,
    ESP32_MSG_REPORT_FULL_FFT_CHUNK = 0x33,
    ESP32_MSG_REPORT_FULL_END = 0x34,
    ESP32_MSG_TX_ACCEPTED = 0x41,
    ESP32_MSG_TX_RESULT = 0x42,
    ESP32_MSG_EVENT = 0x40,
    ESP32_MSG_NACK = 0x43,
} esp32_msg_type_t;

typedef enum {
    ESP32_RESULT_OK = 0,
    ESP32_RESULT_INVALID_ARG = 1,
    ESP32_RESULT_BUSY = 2,
    ESP32_RESULT_QUEUE_FULL = 3,
    ESP32_RESULT_NOT_READY = 4,
    ESP32_RESULT_IO_ERROR = 5,
    ESP32_RESULT_INTERNAL = 6,
} esp32_result_code_t;

typedef enum {
    ESP32_NACK_CRC_FAIL = 1,
    ESP32_NACK_BAD_LENGTH = 2,
    ESP32_NACK_UNSUPPORTED_VERSION = 3,
    ESP32_NACK_QUEUE_FULL = 4,
    ESP32_NACK_BUSY = 5,
    ESP32_NACK_SESSION_MISMATCH = 6,
    ESP32_NACK_INVALID_STATE = 7,
    ESP32_NACK_INVALID_PAYLOAD = 8,
} esp32_nack_reason_t;

typedef enum {
    ESP32_SPI_RX_INVALID_BAD_MAGIC = 0,
    ESP32_SPI_RX_INVALID_BAD_VERSION,
    ESP32_SPI_RX_INVALID_BAD_LEN,
    ESP32_SPI_RX_INVALID_BAD_HEADER_CRC,
    ESP32_SPI_RX_INVALID_BAD_PAYLOAD_CRC,
    ESP32_SPI_RX_INVALID_OTHER,
    ESP32_SPI_RX_INVALID_COUNT,
} esp32_spi_rx_invalid_reason_t;

typedef enum {
    ESP32_EVENT_READY = 1,
    ESP32_EVENT_CONFIG_APPLIED = 2,
    ESP32_EVENT_WIFI_STATE = 3,
    ESP32_EVENT_CLOUD_STATE = 4,
    ESP32_EVENT_REGISTER_RESULT = 5,
    ESP32_EVENT_REPORT_RESULT = 6,
    ESP32_EVENT_SERVER_COMMAND = 7,
    ESP32_EVENT_ERROR = 8,
    ESP32_EVENT_STATUS = 9,
} esp32_event_type_t;

typedef enum {
    ESP32_WIFI_IDLE = 0,
    ESP32_WIFI_CONNECTING = 1,
    ESP32_WIFI_CONNECTED = 2,
    ESP32_WIFI_FAILED = 3,
} esp32_wifi_state_t;

typedef enum {
    ESP32_CLOUD_IDLE = 0,
    ESP32_CLOUD_CONNECTING = 1,
    ESP32_CLOUD_REGISTERED = 2,
    ESP32_CLOUD_FAILED = 3,
} esp32_cloud_state_t;

#pragma pack(push, 1)
typedef struct {
    uint32_t magic;
    uint8_t version;
    uint8_t msg_type;
    uint16_t flags;
    uint32_t session_epoch;
    uint32_t seq;
    uint32_t ack_seq;
    uint16_t payload_len;
    uint16_t header_crc16;
    uint32_t payload_crc32;
} esp32_spi_header_t;

typedef struct {
    uint32_t boot_epoch;
    uint32_t capability_flags;
    uint16_t max_payload;
    uint16_t reserved;
} esp32_hello_payload_t;

typedef struct {
    char wifi_ssid[64];
    char wifi_password[64];
    char server_host[64];
    uint16_t server_port;
    char node_id[64];
    char node_location[64];
    char hw_version[32];
} esp32_device_config_payload_t;

typedef struct {
    uint32_t heartbeat_ms;
    uint32_t min_interval_ms;
    uint32_t http_timeout_ms;
    uint32_t reconnect_backoff_ms;
    uint32_t downsample_step;
    uint32_t upload_points;
    uint32_t hardreset_sec;
    uint32_t chunk_kb;
    uint32_t chunk_delay_ms;
} esp32_comm_params_payload_t;

typedef struct {
    uint8_t report_mode;
    uint8_t reserved0;
    uint16_t reserved1;
} esp32_start_report_payload_t;

typedef struct {
    uint8_t channel_id;
    uint8_t reserved0;
    uint16_t waveform_count;
    uint16_t fft_count;
    uint16_t reserved1;
    int32_t value_scaled;
    int32_t current_value_scaled;
} esp32_report_channel_summary_payload_t;

typedef struct {
    uint32_t frame_id;
    uint64_t timestamp_ms;
    uint32_t downsample_step;
    uint32_t upload_points;
    char fault_code[8];
    uint8_t report_mode;
    uint8_t status_code;
    uint8_t channel_count;
    uint8_t reserved0;
    esp32_report_channel_summary_payload_t channels[4];
} esp32_report_summary_payload_t;

typedef esp32_report_summary_payload_t esp32_report_full_begin_payload_t;

typedef struct {
    uint32_t frame_id;
    uint8_t channel_id;
    uint8_t reserved0;
    uint16_t element_offset;
    uint16_t element_count;
    uint16_t reserved1;
} esp32_report_chunk_prefix_t;

typedef struct {
    uint32_t frame_id;
} esp32_report_end_payload_t;

