lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/ESP32SPI/esp32_spi_debug.c
typedef struct {
    uint16_t event_type;
    uint16_t result_code;
    uint32_t value0;
    uint32_t value1;
    int32_t value2;
    char text[64];
} esp32_event_payload_t;

typedef struct {
    uint32_t ref_seq;
    uint32_t ref_frame_id;
    uint16_t queue_depth;
    uint16_t reserved;
} esp32_tx_accepted_payload_t;

typedef struct {
    uint32_t ref_seq;
    uint32_t ref_frame_id;
    int32_t http_status;
    int32_t result_code;
} esp32_tx_result_payload_t;

typedef struct {
    uint32_t ref_seq;
    uint16_t reason;
    uint16_t reserved;
} esp32_nack_payload_t;

typedef struct {
    uint8_t ready;
    uint8_t wifi_connected;
    uint8_t cloud_connected;
    uint8_t registered_with_cloud;
    uint8_t reporting_enabled;
    uint8_t report_mode;
    int8_t rssi_dbm;
    uint8_t reserved0;
    uint32_t session_epoch;
    uint32_t last_frame_id;
    uint32_t downsample_step;
    uint32_t upload_points;
    int32_t last_http_status;
    uint32_t config_version;
    uint32_t last_command_id;
    int32_t last_error_code;
    char ip_address[16];
    char node_id[64];
    char last_error[64];
} esp32_status_payload_t;
#pragma pack(pop)

typedef struct {
    esp32_spi_header_t header;
    uint8_t payload[ESP32_SPI_MAX_PAYLOAD];
} esp32_spi_packet_t;

typedef bool (*esp32_spi_payload_builder_t)(uint8_t *payload, uint16_t payload_len, void *ctx);

typedef char esp32_spi_header_size_check[(sizeof(esp32_spi_header_t) == 28U) ? 1 : -1];
typedef char esp32_spi_packet_size_check[(sizeof(esp32_spi_packet_t) == ESP32_SPI_FRAME_SIZE) ? 1 : -1];
typedef char esp32_spi_status_size_check[(sizeof(esp32_status_payload_t) == 184U) ? 1 : -1];

static uint8_t s_tx_buf[ESP32_SPI_FRAME_SIZE] __attribute__((aligned(32)));
static uint8_t s_rx_buf[ESP32_SPI_FRAME_SIZE] __attribute__((aligned(32)));
static uint32_t s_tx_seq = 1U;
static uint32_t s_last_rx_seq = 0U;
static uint32_t s_session_epoch = 0U;
static uint32_t s_last_tx_seq = 0U;
static esp32_spi_status_t s_status;
static uint8_t s_last_response_type = ESP32_MSG_NOOP;
static uint16_t s_last_result_code = ESP32_SPI_RESULT_PENDING;
static char s_last_response_text[65];
static uint8_t s_last_event_type = 0U;
static uint16_t s_last_event_result = ESP32_SPI_RESULT_PENDING;
static uint8_t s_wifi_failed_seen = 0U;
static uint8_t s_register_event_seen = 0U;
static uint16_t s_register_result = ESP32_SPI_RESULT_PENDING;
static uint32_t s_last_tx_accepted_ref_seq = 0U;
static uint32_t s_last_tx_result_ref_seq = 0U;
static int32_t s_last_tx_result_code = ESP32_SPI_RESULT_PENDING;
static int32_t s_last_tx_result_http_status = 0;
static uint32_t s_last_tx_result_frame_id = 0U;
static uint32_t s_last_report_full_end_ref_seq = 0U;
static SemaphoreHandle_t s_spi_mutex = NULL;
static SemaphoreHandle_t s_spi_op_mutex = NULL;
static uint32_t s_last_nack_ref_seq = 0U;
static uint16_t s_last_nack_reason = 0U;
static uint8_t s_session_mismatch_seen = 0U;
static uint8_t s_pending_server_reset = 0U;
static uint8_t s_pending_server_report_mode_valid = 0U;
static uint8_t s_pending_server_report_full = 0U;
static uint8_t s_pending_server_downsample_valid = 0U;
static uint32_t s_pending_server_downsample_step = 0U;
static uint8_t s_pending_server_upload_valid = 0U;
static uint32_t s_pending_server_upload_points = 0U;
static uint8_t s_pending_server_heartbeat_valid = 0U;
static uint32_t s_pending_server_heartbeat_ms = 0U;
static uint8_t s_pending_server_min_interval_valid = 0U;
static uint32_t s_pending_server_min_interval_ms = 0U;
static uint8_t s_pending_server_http_timeout_valid = 0U;
static uint32_t s_pending_server_http_timeout_ms = 0U;
static uint8_t s_pending_server_chunk_kb_valid = 0U;
static uint32_t s_pending_server_chunk_kb = 0U;
static uint8_t s_pending_server_chunk_delay_valid = 0U;
static uint32_t s_pending_server_chunk_delay_ms = 0U;
static char s_last_server_cmd_key[65];
static uint32_t s_last_server_cmd_value = 0U;
static uint32_t s_last_server_cmd_tick = 0U;
static uint32_t s_spi_nack_total = 0U;
static uint32_t s_spi_retryable_nack_total = 0U;
static uint32_t s_spi_nack_reason_counts[9];
static uint32_t s_spi_rx_invalid_total = 0U;
static uint32_t s_spi_rx_invalid_counts[ESP32_SPI_RX_INVALID_COUNT];
static uint32_t s_spi_hal_fail_total = 0U;
static uint32_t s_spi_stats_last_log_tick = 0U;

static bool nack_reason_is_retryable(uint16_t reason);

static uint16_t crc16_le_update(uint16_t crc, const uint8_t *data, uint32_t len)
{
    while (len-- > 0U) {
        crc ^= *data++;
        for (uint32_t i = 0; i < 8U; i++) {
            if ((crc & 1U) != 0U) {
                crc = (uint16_t)((crc >> 1U) ^ 0x8408U);
            } else {
                crc = (uint16_t)(crc >> 1U);
            }
        }
    }
    return crc;
}

static uint32_t crc32_le_update(uint32_t crc, const uint8_t *data, uint32_t len)
{
    while (len-- > 0U) {
        crc ^= *data++;
        for (uint32_t i = 0; i < 8U; i++) {
            if ((crc & 1UL) != 0UL) {
                crc = (crc >> 1U) ^ 0xEDB88320UL;
            } else {
                crc >>= 1U;
            }
        }
    }
    return crc;
}

static uint16_t packet_header_crc(const esp32_spi_header_t *header)
{
    esp32_spi_header_t tmp = *header;
    tmp.header_crc16 = 0U;
    return crc16_le_update(0xFFFFU, (const uint8_t *)&tmp, (uint32_t)sizeof(tmp));
}

static uint32_t packet_payload_crc(const uint8_t *payload, uint16_t len)
{
    if (len == 0U) {
        return 0U;
    }
    return crc32_le_update(0U, payload, len);
}

static const char *msg_name(uint8_t msg_type)
{
    switch ((esp32_msg_type_t)msg_type) {
    case ESP32_MSG_NOOP: return "NOOP";
    case ESP32_MSG_HELLO_REQ: return "HELLO_REQ";
    case ESP32_MSG_HELLO_RESP: return "HELLO_RESP";
    case ESP32_MSG_SET_DEVICE_CONFIG_REQ: return "SET_DEVICE_CONFIG_REQ";
    case ESP32_MSG_SET_DEVICE_CONFIG_RESP: return "SET_DEVICE_CONFIG_RESP";
    case ESP32_MSG_SET_COMM_PARAMS_REQ: return "SET_COMM_PARAMS_REQ";
    case ESP32_MSG_SET_COMM_PARAMS_RESP: return "SET_COMM_PARAMS_RESP";
    case ESP32_MSG_CONNECT_REQ: return "CONNECT_REQ";
    case ESP32_MSG_CONNECT_RESP: return "CONNECT_RESP";
    case ESP32_MSG_DISCONNECT_REQ: return "DISCONNECT_REQ";
    case ESP32_MSG_DISCONNECT_RESP: return "DISCONNECT_RESP";
    case ESP32_MSG_START_REPORT_REQ: return "START_REPORT_REQ";
    case ESP32_MSG_START_REPORT_RESP: return "START_REPORT_RESP";
    case ESP32_MSG_STOP_REPORT_REQ: return "STOP_REPORT_REQ";
    case ESP32_MSG_STOP_REPORT_RESP: return "STOP_REPORT_RESP";
    case ESP32_MSG_QUERY_STATUS_REQ: return "QUERY_STATUS_REQ";
    case ESP32_MSG_STATUS_RESP: return "STATUS_RESP";
    case ESP32_MSG_PING_REQ: return "PING_REQ";
    case ESP32_MSG_PING_RESP: return "PING_RESP";
    case ESP32_MSG_CLOUD_CONNECT_REQ: return "CLOUD_CONNECT_REQ";
    case ESP32_MSG_CLOUD_CONNECT_RESP: return "CLOUD_CONNECT_RESP";
    case ESP32_MSG_REGISTER_REQ: return "REGISTER_REQ";
    case ESP32_MSG_REGISTER_RESP: return "REGISTER_RESP";
    case ESP32_MSG_REPORT_SUMMARY: return "REPORT_SUMMARY";
    case ESP32_MSG_REPORT_FULL_BEGIN: return "REPORT_FULL_BEGIN";
    case ESP32_MSG_REPORT_FULL_WAVE_CHUNK: return "REPORT_FULL_WAVE_CHUNK";
    case ESP32_MSG_REPORT_FULL_FFT_CHUNK: return "REPORT_FULL_FFT_CHUNK";
    case ESP32_MSG_REPORT_FULL_END: return "REPORT_FULL_END";
    case ESP32_MSG_TX_ACCEPTED: return "TX_ACCEPTED";
    case ESP32_MSG_TX_RESULT: return "TX_RESULT";
    case ESP32_MSG_EVENT: return "EVENT";
    case ESP32_MSG_NACK: return "NACK";
    default: return "UNKNOWN";
    }
}

static const char *nack_reason_name(uint16_t reason)
{
    switch (reason) {
    case ESP32_NACK_CRC_FAIL: return "CRC_FAIL";
    case ESP32_NACK_BAD_LENGTH: return "BAD_LENGTH";
    case ESP32_NACK_UNSUPPORTED_VERSION: return "UNSUPPORTED_VERSION";
    case ESP32_NACK_QUEUE_FULL: return "QUEUE_FULL";
    case ESP32_NACK_BUSY: return "BUSY";
    case ESP32_NACK_SESSION_MISMATCH: return "SESSION_MISMATCH";
    case ESP32_NACK_INVALID_STATE: return "INVALID_STATE";
    case ESP32_NACK_INVALID_PAYLOAD: return "INVALID_PAYLOAD";
    default: return "UNKNOWN";
    }
}

