lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/ESP32SPI/esp32_spi_debug.c
static esp32_spi_rx_invalid_reason_t rx_invalid_reason_index(const char *reason)
{
    if (reason == NULL) {
        return ESP32_SPI_RX_INVALID_OTHER;
    }
    if (strcmp(reason, "bad_magic") == 0) {
        return ESP32_SPI_RX_INVALID_BAD_MAGIC;
    }
    if (strcmp(reason, "bad_version") == 0) {
        return ESP32_SPI_RX_INVALID_BAD_VERSION;
    }
    if (strcmp(reason, "bad_len") == 0) {
        return ESP32_SPI_RX_INVALID_BAD_LEN;
    }
    if (strcmp(reason, "bad_header_crc") == 0) {
        return ESP32_SPI_RX_INVALID_BAD_HEADER_CRC;
    }
    if (strcmp(reason, "bad_payload_crc") == 0) {
        return ESP32_SPI_RX_INVALID_BAD_PAYLOAD_CRC;
    }
    return ESP32_SPI_RX_INVALID_OTHER;
}

static void spi_stats_log_if_due(void)
{
    uint32_t now = HAL_GetTick();

    if (s_spi_stats_last_log_tick != 0U &&
        (now - s_spi_stats_last_log_tick) < ESP32_SPI_STATS_LOG_INTERVAL_MS) {
        return;
    }
    s_spi_stats_last_log_tick = now;
    printf("[ESP32SPI][spi_stats] nack_total=%lu retryable=%lu crc=%lu bad_len=%lu unsupported=%lu qfull=%lu busy=%lu session=%lu invalid_state=%lu invalid_payload=%lu rx_invalid=%lu bad_magic=%lu bad_version=%lu rx_bad_len=%lu bad_header_crc=%lu bad_payload_crc=%lu rx_other=%lu hal_fail=%lu\r\n",
           (unsigned long)s_spi_nack_total,
           (unsigned long)s_spi_retryable_nack_total,
           (unsigned long)s_spi_nack_reason_counts[ESP32_NACK_CRC_FAIL],
           (unsigned long)s_spi_nack_reason_counts[ESP32_NACK_BAD_LENGTH],
           (unsigned long)s_spi_nack_reason_counts[ESP32_NACK_UNSUPPORTED_VERSION],
           (unsigned long)s_spi_nack_reason_counts[ESP32_NACK_QUEUE_FULL],
           (unsigned long)s_spi_nack_reason_counts[ESP32_NACK_BUSY],
           (unsigned long)s_spi_nack_reason_counts[ESP32_NACK_SESSION_MISMATCH],
           (unsigned long)s_spi_nack_reason_counts[ESP32_NACK_INVALID_STATE],
           (unsigned long)s_spi_nack_reason_counts[ESP32_NACK_INVALID_PAYLOAD],
           (unsigned long)s_spi_rx_invalid_total,
           (unsigned long)s_spi_rx_invalid_counts[ESP32_SPI_RX_INVALID_BAD_MAGIC],
           (unsigned long)s_spi_rx_invalid_counts[ESP32_SPI_RX_INVALID_BAD_VERSION],
           (unsigned long)s_spi_rx_invalid_counts[ESP32_SPI_RX_INVALID_BAD_LEN],
           (unsigned long)s_spi_rx_invalid_counts[ESP32_SPI_RX_INVALID_BAD_HEADER_CRC],
           (unsigned long)s_spi_rx_invalid_counts[ESP32_SPI_RX_INVALID_BAD_PAYLOAD_CRC],
           (unsigned long)s_spi_rx_invalid_counts[ESP32_SPI_RX_INVALID_OTHER],
           (unsigned long)s_spi_hal_fail_total);
}

static void spi_stats_note_nack(uint16_t reason)
{
    s_spi_nack_total++;
    if (reason < (uint16_t)(sizeof(s_spi_nack_reason_counts) / sizeof(s_spi_nack_reason_counts[0]))) {
        s_spi_nack_reason_counts[reason]++;
    }
    if (nack_reason_is_retryable(reason)) {
        s_spi_retryable_nack_total++;
    }
    spi_stats_log_if_due();
}

static void spi_stats_note_rx_invalid(const char *reason)
{
    esp32_spi_rx_invalid_reason_t index = rx_invalid_reason_index(reason);

    s_spi_rx_invalid_total++;
    s_spi_rx_invalid_counts[index]++;
    spi_stats_log_if_due();
}

static void spi_stats_note_hal_fail(void)
{
    s_spi_hal_fail_total++;
    spi_stats_log_if_due();
}

static bool is_full_chunk_msg(uint8_t msg_type)
{
    return msg_type == ESP32_MSG_REPORT_FULL_WAVE_CHUNK ||
           msg_type == ESP32_MSG_REPORT_FULL_FFT_CHUNK;
}

static bool should_log_event_payload(const esp32_event_payload_t *event)
{
    if (event == NULL) {
        return false;
    }

    if (event->event_type == ESP32_EVENT_ERROR) {
        return true;
    }
    if (event->event_type == ESP32_EVENT_WIFI_STATE &&
        event->result_code == ESP32_WIFI_FAILED) {
        return true;
    }
    if (event->event_type == ESP32_EVENT_CLOUD_STATE &&
        event->result_code == ESP32_CLOUD_FAILED) {
        return true;
    }
    return false;
}

static bool should_log_packet(uint8_t msg_type)
{
    if (msg_type == ESP32_MSG_NOOP) {
        return false;
    }
    if (msg_type == ESP32_MSG_EVENT) {
        return false;
    }
#if (!ESP32_SPI_LOG_FULL_CHUNKS)
    if (is_full_chunk_msg(msg_type)) {
        return false;
    }
#endif
#if (!ESP32_SPI_LOG_TX_ACCEPTED)
    if (msg_type == ESP32_MSG_TX_ACCEPTED) {
        return false;
    }
#endif
    return true;
}

static void copy_text(char *dst, size_t dst_size, const char *src)
{
    if (dst_size == 0U) {
        return;
    }
    dst[0] = '\0';
    if (src == NULL) {
        return;
    }
    strncpy(dst, src, dst_size - 1U);
    dst[dst_size - 1U] = '\0';
}

static void copy_fixed_text(char *dst, size_t dst_size, const char *src, size_t src_size)
{
    size_t n = 0U;

    if (dst_size == 0U) {
        return;
    }
    dst[0] = '\0';
    if (src == NULL || src_size == 0U) {
        return;
    }
    while (n < src_size && n < (dst_size - 1U) && src[n] != '\0') {
        dst[n] = src[n];
        n++;
    }
    dst[n] = '\0';
}

static bool accept_server_command_event(const char *key, uint32_t value)
{
    uint32_t now = HAL_GetTick();

    if (key == NULL) {
        key = "";
    }

    if (strncmp(s_last_server_cmd_key, key, sizeof(s_last_server_cmd_key)) == 0 &&
        s_last_server_cmd_value == value &&
        (now - s_last_server_cmd_tick) < 10000U) {
        return false;
    }
    copy_text(s_last_server_cmd_key, sizeof(s_last_server_cmd_key), key);
    s_last_server_cmd_value = value;
    s_last_server_cmd_tick = now;
    return true;
}

static void packet_prepare(esp32_spi_packet_t *packet, uint8_t msg_type)
{
    memset(packet, 0, sizeof(*packet));
    packet->header.magic = ESP32_SPI_MAGIC;
    packet->header.version = ESP32_SPI_VERSION;
    packet->header.msg_type = msg_type;
    packet->header.session_epoch = (msg_type == ESP32_MSG_HELLO_REQ) ? 0U : s_session_epoch;
    packet->header.ack_seq = s_last_rx_seq;
    if (msg_type != ESP32_MSG_NOOP) {
        packet->header.seq = s_tx_seq++;
    }
}

static void packet_finalize(esp32_spi_packet_t *packet)
{
    packet->header.payload_crc32 = packet_payload_crc(packet->payload, packet->header.payload_len);
    packet->header.header_crc16 = packet_header_crc(&packet->header);
}

static bool packet_validate(const esp32_spi_packet_t *packet, const char **reason)
{
    uint16_t header_crc;
    uint32_t payload_crc;

    if (packet->header.magic != ESP32_SPI_MAGIC) {
        *reason = "bad_magic";
        return false;
    }
    if (packet->header.version != ESP32_SPI_VERSION) {
        *reason = "bad_version";
        return false;
    }
    if (packet->header.payload_len > ESP32_SPI_MAX_PAYLOAD) {
        *reason = "bad_len";
        return false;
    }
    header_crc = packet_header_crc(&packet->header);
    if (header_crc != packet->header.header_crc16) {
        *reason = "bad_header_crc";
        return false;
    }
    payload_crc = packet_payload_crc(packet->payload, packet->header.payload_len);
    if (payload_crc != packet->header.payload_crc32) {
        *reason = "bad_payload_crc";
        return false;
    }

    *reason = "ok";
    return true;
}

static bool wait_ready(uint32_t timeout_ms)
{
    uint32_t start = HAL_GetTick();

    while ((HAL_GetTick() - start) < timeout_ms) {
        if (HAL_GPIO_ReadPin(ESP32_READY_GPIO_Port, ESP32_READY_Pin) == GPIO_PIN_SET) {
            return true;
        }
        HAL_Delay(1);
    }
    return false;
}

static void wait_ready_release(uint32_t timeout_ms)
{
    uint32_t start = HAL_GetTick();

    while (HAL_GPIO_ReadPin(ESP32_READY_GPIO_Port, ESP32_READY_Pin) == GPIO_PIN_SET &&
           (HAL_GetTick() - start) < timeout_ms) {
        for (volatile uint32_t i = 0; i < 200U; i++) {
            __NOP();
        }
    }
}

static bool spi_bus_lock(void)
{
    SemaphoreHandle_t mutex;

