lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/ESP32SPI/esp32_spi_debug.c
    if (__get_IPSR() != 0U || xTaskGetSchedulerState() == taskSCHEDULER_NOT_STARTED) {
        return true;
    }

    mutex = s_spi_mutex;
    if (mutex == NULL) {
        mutex = xSemaphoreCreateMutex();
        if (mutex == NULL) {
            return true;
        }
        s_spi_mutex = mutex;
    }

    if (xSemaphoreTake(mutex, pdMS_TO_TICKS(ESP32_SPI_LOCK_TIMEOUT_MS)) == pdTRUE) {
        return true;
    }
    printf("[ESP32SPI] SPI bus lock timeout\r\n");
    return false;
}

static void spi_bus_unlock(void)
{
    if (__get_IPSR() != 0U || xTaskGetSchedulerState() == taskSCHEDULER_NOT_STARTED) {
        return;
    }
    if (s_spi_mutex != NULL) {
        (void)xSemaphoreGive(s_spi_mutex);
    }
}

static bool spi_op_lock(void)
{
    SemaphoreHandle_t mutex;

    if (__get_IPSR() != 0U || xTaskGetSchedulerState() == taskSCHEDULER_NOT_STARTED) {
        return true;
    }

    mutex = s_spi_op_mutex;
    if (mutex == NULL) {
        mutex = xSemaphoreCreateRecursiveMutex();
        if (mutex == NULL) {
            return true;
        }
        s_spi_op_mutex = mutex;
    }

    if (xSemaphoreTakeRecursive(mutex, pdMS_TO_TICKS(ESP32_SPI_LOCK_TIMEOUT_MS)) == pdTRUE) {
        return true;
    }
    printf("[ESP32SPI] SPI op lock timeout\r\n");
    return false;
}

static void spi_op_unlock(void)
{
    if (__get_IPSR() != 0U || xTaskGetSchedulerState() == taskSCHEDULER_NOT_STARTED) {
        return;
    }
    if (s_spi_op_mutex != NULL) {
        (void)xSemaphoreGiveRecursive(s_spi_op_mutex);
    }
}

static void cs_set(GPIO_PinState state)
{
    HAL_GPIO_WritePin(ESP32_CS_GPIO_Port, ESP32_CS_Pin, state);
    for (volatile uint32_t i = 0; i < 400U; i++) {
        __NOP();
    }
}

typedef struct {
    const void *payload;
} esp32_spi_copy_payload_ctx_t;

static bool copy_payload_builder(uint8_t *payload, uint16_t payload_len, void *ctx)
{
    const esp32_spi_copy_payload_ctx_t *copy = (const esp32_spi_copy_payload_ctx_t *)ctx;

    if (payload_len == 0U) {
        return true;
    }
    if (payload == NULL || copy == NULL || copy->payload == NULL) {
        return false;
    }
    memcpy(payload, copy->payload, payload_len);
    return true;
}

static bool spi_transaction_built_payload(uint8_t tx_type,
                                          uint16_t payload_len,
                                          esp32_spi_payload_builder_t builder,
                                          void *builder_ctx,
                                          esp32_spi_packet_t *rx_packet)
{
    esp32_spi_packet_t *tx_packet = (esp32_spi_packet_t *)s_tx_buf;
    HAL_StatusTypeDef st;

    if (payload_len > ESP32_SPI_MAX_PAYLOAD) {
        printf("[ESP32SPI] payload too large: type=%s len=%u\r\n",
               msg_name(tx_type), (unsigned int)payload_len);
        return false;
    }
    if (payload_len > 0U && builder == NULL) {
        return false;
    }

    memset(s_rx_buf, 0, sizeof(s_rx_buf));
    packet_prepare(tx_packet, tx_type);
    if (payload_len > 0U && !builder(tx_packet->payload, payload_len, builder_ctx)) {
        return false;
    }
    tx_packet->header.payload_len = payload_len;
    packet_finalize(tx_packet);
    s_last_tx_seq = tx_packet->header.seq;

    if (should_log_packet(tx_type)) {
        printf("[ESP32SPI] TX %-22s seq=%lu ack=%lu session=%lu len=%u ready=%u\r\n",
               msg_name(tx_type),
               (unsigned long)tx_packet->header.seq,
               (unsigned long)tx_packet->header.ack_seq,
               (unsigned long)tx_packet->header.session_epoch,
               (unsigned int)tx_packet->header.payload_len,
               (unsigned int)HAL_GPIO_ReadPin(ESP32_READY_GPIO_Port, ESP32_READY_Pin));
    }

    if (!wait_ready(ESP32_SPI_READY_TIMEOUT_MS)) {
        printf("[ESP32SPI] READY timeout, level=%u\r\n",
               (unsigned int)HAL_GPIO_ReadPin(ESP32_READY_GPIO_Port, ESP32_READY_Pin));
        return false;
    }

    cs_set(GPIO_PIN_RESET);
    st = HAL_SPI_TransmitReceive(&hspi2, s_tx_buf, s_rx_buf, ESP32_SPI_FRAME_SIZE, ESP32_SPI_XFER_TIMEOUT_MS);
    cs_set(GPIO_PIN_SET);
    wait_ready_release(ESP32_SPI_READY_RELEASE_TIMEOUT_MS);
    HAL_Delay(ESP32_SPI_INTER_TRANSACTION_GUARD_MS);

    if (st != HAL_OK) {
        spi_stats_note_hal_fail();
        printf("[ESP32SPI] HAL_SPI_TransmitReceive failed, st=%d err=0x%08lX state=%d\r\n",
               (int)st,
               (unsigned long)HAL_SPI_GetError(&hspi2),
               (int)HAL_SPI_GetState(&hspi2));
        (void)HAL_SPI_Abort(&hspi2);
        return false;
    }

    memcpy(rx_packet, s_rx_buf, sizeof(*rx_packet));
    return true;
}

static bool spi_transaction_payload(uint8_t tx_type,
                                    const void *payload,
                                    uint16_t payload_len,
                                    esp32_spi_packet_t *rx_packet)
{
    esp32_spi_copy_payload_ctx_t ctx;

    if (payload_len == 0U) {
        return spi_transaction_built_payload(tx_type, 0U, NULL, NULL, rx_packet);
    }

    ctx.payload = payload;
    return spi_transaction_built_payload(tx_type, payload_len, copy_payload_builder, &ctx, rx_packet);
}

static void print_text64(const char *text)
{
    char tmp[65];
    memcpy(tmp, text, 64U);
    tmp[64] = '\0';
    printf("%s", tmp);
}

static bool is_simple_response(uint8_t msg_type)
{
    switch ((esp32_msg_type_t)msg_type) {
    case ESP32_MSG_SET_DEVICE_CONFIG_RESP:
    case ESP32_MSG_SET_COMM_PARAMS_RESP:
    case ESP32_MSG_CONNECT_RESP:
    case ESP32_MSG_DISCONNECT_RESP:
    case ESP32_MSG_START_REPORT_RESP:
    case ESP32_MSG_STOP_REPORT_RESP:
    case ESP32_MSG_PING_RESP:
    case ESP32_MSG_CLOUD_CONNECT_RESP:
    case ESP32_MSG_REGISTER_RESP:
        return true;
    default:
        return false;
    }
}

static void update_status_from_payload(const esp32_status_payload_t *payload)
{
    s_status.ready = payload->ready;
    s_status.wifi_connected = payload->wifi_connected;
    s_status.cloud_connected = payload->cloud_connected;
    s_status.registered_with_cloud = payload->registered_with_cloud;
    s_status.reporting_enabled = payload->reporting_enabled;
    s_status.report_mode = payload->report_mode;
    s_status.rssi_dbm = payload->rssi_dbm;
    s_status.session_epoch = payload->session_epoch;
    s_status.last_frame_id = payload->last_frame_id;
    s_status.downsample_step = payload->downsample_step;
    s_status.upload_points = payload->upload_points;
    s_status.last_http_status = payload->last_http_status;
    s_status.config_version = payload->config_version;
    s_status.last_command_id = payload->last_command_id;
    s_status.last_error_code = payload->last_error_code;
    copy_fixed_text(s_status.ip_address, sizeof(s_status.ip_address), payload->ip_address, sizeof(payload->ip_address));
    copy_fixed_text(s_status.node_id, sizeof(s_status.node_id), payload->node_id, sizeof(payload->node_id));
    copy_fixed_text(s_status.last_error, sizeof(s_status.last_error), payload->last_error, sizeof(payload->last_error));
    if (payload->session_epoch != 0U) {
        s_session_epoch = payload->session_epoch;
    }
}

static void update_status_from_event(const esp32_event_payload_t *event)
{
    s_last_event_type = (uint8_t)event->event_type;
    s_last_event_result = event->result_code;

    switch ((esp32_event_type_t)event->event_type) {
    case ESP32_EVENT_READY:
        s_status.ready = 1U;
        if (s_session_epoch == 0U && event->value0 != 0U) {
            s_session_epoch = event->value0;
            s_status.session_epoch = event->value0;
        }
        break;
    case ESP32_EVENT_WIFI_STATE:
        if (event->result_code == ESP32_WIFI_CONNECTED) {
            s_status.wifi_connected = 1U;
            s_wifi_failed_seen = 0U;
            copy_fixed_text(s_status.ip_address, sizeof(s_status.ip_address), event->text, sizeof(event->text));
            s_status.rssi_dbm = (int8_t)event->value2;
        } else if (event->result_code == ESP32_WIFI_FAILED) {
            s_status.wifi_connected = 0U;
            s_status.cloud_connected = 0U;
            s_status.registered_with_cloud = 0U;
            s_wifi_failed_seen = 1U;
            copy_text(s_status.last_error, sizeof(s_status.last_error), "wifi_failed");
        } else if (event->result_code == ESP32_WIFI_IDLE) {
            s_status.wifi_connected = 0U;
            s_status.cloud_connected = 0U;
            s_status.registered_with_cloud = 0U;
        }
        break;
    case ESP32_EVENT_CLOUD_STATE:
        if (event->result_code == ESP32_CLOUD_REGISTERED) {
            s_status.cloud_connected = 1U;
            s_status.registered_with_cloud = 1U;
        } else if (event->result_code == ESP32_CLOUD_CONNECTING) {
            s_status.cloud_connected = 1U;
        } else if (event->result_code == ESP32_CLOUD_FAILED) {
            s_status.cloud_connected = 0U;
            s_status.registered_with_cloud = 0U;
        }
        copy_fixed_text(s_status.last_error, sizeof(s_status.last_error), event->text, sizeof(event->text));
        break;
    case ESP32_EVENT_REGISTER_RESULT:
        s_register_event_seen = 1U;
        s_register_result = event->result_code;
        s_status.last_http_status = (int32_t)event->value0;
        if (event->result_code == ESP32_RESULT_OK) {
            s_status.cloud_connected = 1U;
            s_status.registered_with_cloud = 1U;
        } else {
            s_status.cloud_connected = 0U;
            s_status.registered_with_cloud = 0U;
        }
        copy_fixed_text(s_status.last_error, sizeof(s_status.last_error), event->text, sizeof(event->text));
        break;
    case ESP32_EVENT_REPORT_RESULT:
        s_status.last_http_status = (int32_t)event->value0;
        s_status.last_frame_id = event->value1;
        copy_fixed_text(s_status.last_error, sizeof(s_status.last_error), event->text, sizeof(event->text));
        break;
    case ESP32_EVENT_SERVER_COMMAND:
    {
        char text[65];
        copy_fixed_text(text, sizeof(text), event->text, sizeof(event->text));
        copy_text(s_status.last_error, sizeof(s_status.last_error), text);
        if (event->result_code != ESP32_RESULT_OK) {
            break;
        }
        if (!accept_server_command_event(text, event->value1)) {
            break;
        }
        if (strcmp(text, "reset") == 0) {
            s_pending_server_reset = 1U;
        } else if (strcmp(text, "report_mode") == 0) {
            s_pending_server_report_mode_valid = 1U;
            s_pending_server_report_full = (event->value1 != 0U) ? 1U : 0U;
            s_status.report_mode = s_pending_server_report_full;
        } else if (strcmp(text, "downsample_step") == 0) {
            s_pending_server_downsample_valid = 1U;
            s_pending_server_downsample_step = event->value1;
            s_status.downsample_step = event->value1;
        } else if (strcmp(text, "upload_points") == 0) {
            s_pending_server_upload_valid = 1U;
            s_pending_server_upload_points = event->value1;
            s_status.upload_points = event->value1;
        } else if (strcmp(text, "heartbeat_ms") == 0) {
            s_pending_server_heartbeat_valid = 1U;
            s_pending_server_heartbeat_ms = event->value1;
        } else if (strcmp(text, "min_interval_ms") == 0) {
            s_pending_server_min_interval_valid = 1U;
            s_pending_server_min_interval_ms = event->value1;
        } else if (strcmp(text, "http_timeout_ms") == 0) {
            s_pending_server_http_timeout_valid = 1U;
            s_pending_server_http_timeout_ms = event->value1;
        } else if (strcmp(text, "chunk_kb") == 0) {
            s_pending_server_chunk_kb_valid = 1U;
            s_pending_server_chunk_kb = event->value1;
        } else if (strcmp(text, "chunk_delay_ms") == 0) {
            s_pending_server_chunk_delay_valid = 1U;
            s_pending_server_chunk_delay_ms = event->value1;
        }
        break;
    }
    case ESP32_EVENT_ERROR:
        copy_fixed_text(s_status.last_error, sizeof(s_status.last_error), event->text, sizeof(event->text));
        break;
    default:
        break;
    }
}

static bool handle_rx_packet(const esp32_spi_packet_t *packet)
{
    const char *reason = NULL;

    if (!packet_validate(packet, &reason)) {
        spi_stats_note_rx_invalid(reason);
        printf("[ESP32SPI] RX invalid: %s magic=0x%08lX type=0x%02X seq=%lu ack=%lu session=%lu len=%u\r\n",
               reason,
               (unsigned long)packet->header.magic,
               (unsigned int)packet->header.msg_type,
               (unsigned long)packet->header.seq,
               (unsigned long)packet->header.ack_seq,
               (unsigned long)packet->header.session_epoch,
               (unsigned int)packet->header.payload_len);
        return false;
    }

    if (should_log_packet(packet->header.msg_type)) {
        printf("[ESP32SPI] RX %-22s seq=%lu ack=%lu session=%lu len=%u\r\n",
               msg_name(packet->header.msg_type),
               (unsigned long)packet->header.seq,
               (unsigned long)packet->header.ack_seq,
               (unsigned long)packet->header.session_epoch,
               (unsigned int)packet->header.payload_len);
    }

    if (packet->header.session_epoch != 0U && packet->header.session_epoch != s_session_epoch) {
        if (s_session_epoch != 0U) {
            printf("[ESP32SPI] session changed: old=%lu new=%lu\r\n",
                   (unsigned long)s_session_epoch,
                   (unsigned long)packet->header.session_epoch);
            s_session_mismatch_seen = 1U;
        }
        s_session_epoch = packet->header.session_epoch;
        s_status.session_epoch = packet->header.session_epoch;
        s_last_rx_seq = 0U;
        s_tx_seq = 1U;
    }
    if (packet->header.seq != 0U && packet->header.seq > s_last_rx_seq) {
        s_last_rx_seq = packet->header.seq;
    }

