lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/ESP32SPI/esp32_spi_debug.c
    if (is_simple_response(packet->header.msg_type) &&
        packet->header.payload_len >= sizeof(esp32_event_payload_t)) {
        const esp32_event_payload_t *resp = (const esp32_event_payload_t *)packet->payload;
        s_last_response_type = packet->header.msg_type;
        s_last_result_code = resp->result_code;
        copy_fixed_text(s_last_response_text, sizeof(s_last_response_text), resp->text, sizeof(resp->text));
        printf("[ESP32SPI] RESP type=%s result=%u text=%s\r\n",
               msg_name(packet->header.msg_type),
               (unsigned int)resp->result_code,
               s_last_response_text);
    }

    switch ((esp32_msg_type_t)packet->header.msg_type) {
    case ESP32_MSG_HELLO_RESP:
        if (packet->header.payload_len >= sizeof(esp32_hello_payload_t)) {
            const esp32_hello_payload_t *hello = (const esp32_hello_payload_t *)packet->payload;
            s_session_epoch = hello->boot_epoch;
            s_status.ready = 1U;
            s_status.session_epoch = hello->boot_epoch;
            s_last_response_type = ESP32_MSG_HELLO_RESP;
            s_last_result_code = ESP32_RESULT_OK;
            printf("[ESP32SPI] HELLO boot=%lu caps=0x%08lX max_payload=%u\r\n",
                   (unsigned long)hello->boot_epoch,
                   (unsigned long)hello->capability_flags,
                   (unsigned int)hello->max_payload);
        }
        break;
    case ESP32_MSG_STATUS_RESP:
        if (packet->header.payload_len >= sizeof(esp32_status_payload_t)) {
            const esp32_status_payload_t *status = (const esp32_status_payload_t *)packet->payload;
            update_status_from_payload(status);
            s_last_response_type = ESP32_MSG_STATUS_RESP;
            s_last_result_code = ESP32_RESULT_OK;
            printf("[ESP32SPI] STATUS ready=%u wifi=%u cloud=%u reg=%u report=%u mode=%u ip=%s node=%s err=%s\r\n",
                   (unsigned int)s_status.ready,
                   (unsigned int)s_status.wifi_connected,
                   (unsigned int)s_status.cloud_connected,
                   (unsigned int)s_status.registered_with_cloud,
                   (unsigned int)s_status.reporting_enabled,
                   (unsigned int)s_status.report_mode,
                   s_status.ip_address,
                   s_status.node_id,
                   s_status.last_error);
        }
        break;
    case ESP32_MSG_EVENT:
    case ESP32_MSG_PING_RESP:
        if (packet->header.payload_len >= sizeof(esp32_event_payload_t)) {
            const esp32_event_payload_t *event = (const esp32_event_payload_t *)packet->payload;
            update_status_from_event(event);
            if (should_log_event_payload(event)) {
                printf("[ESP32SPI] EVENT type=%u result=%u v0=%lu v1=%lu text=",
                       (unsigned int)event->event_type,
                       (unsigned int)event->result_code,
                       (unsigned long)event->value0,
                       (unsigned long)event->value1);
                print_text64(event->text);
                printf("\r\n");
            }
        }
        break;
    case ESP32_MSG_TX_ACCEPTED:
        if (packet->header.payload_len >= sizeof(esp32_tx_accepted_payload_t)) {
            const esp32_tx_accepted_payload_t *accepted = (const esp32_tx_accepted_payload_t *)packet->payload;
            s_last_tx_accepted_ref_seq = accepted->ref_seq;
#if (ESP32_SPI_LOG_TX_ACCEPTED)
            printf("[ESP32SPI] TX_ACCEPTED ref_seq=%lu frame=%lu q=%u\r\n",
                   (unsigned long)accepted->ref_seq,
                   (unsigned long)accepted->ref_frame_id,
                   (unsigned int)accepted->queue_depth);
#endif
        }
        break;
    case ESP32_MSG_TX_RESULT:
        if (packet->header.payload_len >= sizeof(esp32_tx_result_payload_t)) {
            const esp32_tx_result_payload_t *result = (const esp32_tx_result_payload_t *)packet->payload;
            s_last_tx_result_ref_seq = result->ref_seq;
            s_last_tx_result_code = result->result_code;
            s_last_tx_result_http_status = result->http_status;
            s_last_tx_result_frame_id = result->ref_frame_id;
            s_status.last_http_status = result->http_status;
            s_status.last_frame_id = result->ref_frame_id;
            printf("[ESP32SPI] TX_RESULT ref_seq=%lu frame=%lu http=%ld result=%ld\r\n",
                   (unsigned long)result->ref_seq,
                   (unsigned long)result->ref_frame_id,
                   (long)result->http_status,
                   (long)result->result_code);
        }
        break;
    case ESP32_MSG_NACK:
        if (packet->header.payload_len >= sizeof(esp32_nack_payload_t)) {
            const esp32_nack_payload_t *nack = (const esp32_nack_payload_t *)packet->payload;
            s_last_nack_ref_seq = nack->ref_seq;
            s_last_nack_reason = nack->reason;
            spi_stats_note_nack(nack->reason);
            if (nack->reason == ESP32_NACK_SESSION_MISMATCH) {
                s_session_epoch = 0U;
                s_status.session_epoch = 0U;
                s_session_mismatch_seen = 1U;
            }
            if (!nack_reason_is_retryable(nack->reason) || ESP32_SPI_LOG_RETRYABLE_NACKS) {
                printf("[ESP32SPI] NACK ref_seq=%lu reason=%u(%s)\r\n",
                       (unsigned long)nack->ref_seq,
                       (unsigned int)nack->reason,
                       nack_reason_name(nack->reason));
            }
        }
        break;
    default:
        break;
    }
    return true;
}

static bool transact_and_handle_payload(uint8_t tx_type,
                                        const void *payload,
                                        uint16_t payload_len,
                                        uint8_t *rx_type)
{
    esp32_spi_packet_t rx_packet;
    bool ok;

    if (!spi_bus_lock()) {
        return false;
    }
    if (!spi_transaction_payload(tx_type, payload, payload_len, &rx_packet)) {
        spi_bus_unlock();
        return false;
    }
    ok = handle_rx_packet(&rx_packet);
    if (rx_type != NULL) {
        *rx_type = rx_packet.header.msg_type;
    }
    spi_bus_unlock();
    return ok;
}

static bool transact_and_handle_built_payload(uint8_t tx_type,
                                              uint16_t payload_len,
                                              esp32_spi_payload_builder_t builder,
                                              void *builder_ctx,
                                              uint8_t *rx_type)
{
    esp32_spi_packet_t rx_packet;
    bool ok;

    if (!spi_bus_lock()) {
        return false;
    }
    if (!spi_transaction_built_payload(tx_type, payload_len, builder, builder_ctx, &rx_packet)) {
        spi_bus_unlock();
        return false;
    }
    ok = handle_rx_packet(&rx_packet);
    if (rx_type != NULL) {
        *rx_type = rx_packet.header.msg_type;
    }
    spi_bus_unlock();
    return ok;
}

static bool poll_noop(uint32_t timeout_ms)
{
    uint32_t start = HAL_GetTick();
    uint8_t rx_type;

    do {
        if (!transact_and_handle_payload(ESP32_MSG_NOOP, NULL, 0U, &rx_type)) {
            return false;
        }
        if (rx_type != ESP32_MSG_NOOP) {
            return true;
        }
        HAL_Delay(10);
    } while ((HAL_GetTick() - start) < timeout_ms);

