lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/ESP32SPI/esp32_spi_debug.c
    return true;
}

static void drain_pending_packets(uint32_t max_ms, uint8_t quiet_noop_count)
{
    uint32_t start = HAL_GetTick();
    uint8_t quiet = 0U;
    uint8_t rx_type = ESP32_MSG_NOOP;

    while ((HAL_GetTick() - start) < max_ms && quiet < quiet_noop_count) {
        if (!transact_and_handle_payload(ESP32_MSG_NOOP, NULL, 0U, &rx_type)) {
            return;
        }
        if (rx_type == ESP32_MSG_NOOP) {
            quiet++;
        } else {
            quiet = 0U;
        }
        HAL_Delay(5);
    }
    printf("[ESP32SPI] drain done, quiet=%u/%u last_rx_seq=%lu\r\n",
           (unsigned int)quiet,
           (unsigned int)quiet_noop_count,
           (unsigned long)s_last_rx_seq);
}

static bool wait_for_response(uint8_t response_type, uint32_t timeout_ms)
{
    uint32_t start = HAL_GetTick();

    if (s_last_response_type == response_type) {
        return s_last_result_code == ESP32_RESULT_OK;
    }

    while ((HAL_GetTick() - start) < timeout_ms) {
        if (!poll_noop(40U)) {
            return false;
        }
        if (s_last_response_type == response_type) {
            return s_last_result_code == ESP32_RESULT_OK;
        }
        if (s_session_mismatch_seen) {
            return false;
        }
    }

    printf("[ESP32SPI] response timeout: expect=%s last=%s result=%u text=%s\r\n",
           msg_name(response_type),
           msg_name(s_last_response_type),
           (unsigned int)s_last_result_code,
           s_last_response_text);
    return false;
}

static bool request_wait_response(uint8_t request_type,
                                  const void *payload,
                                  uint16_t payload_len,
                                  uint8_t response_type,
                                  uint32_t timeout_ms)
{
    uint8_t rx_type;

    s_last_response_type = ESP32_MSG_NOOP;
    s_last_result_code = ESP32_SPI_RESULT_PENDING;
    s_last_response_text[0] = '\0';
    s_last_nack_ref_seq = 0U;
    s_last_nack_reason = 0U;
    s_session_mismatch_seen = 0U;

    if (!transact_and_handle_payload(request_type, payload, payload_len, &rx_type)) {
        return false;
    }
    if (s_session_mismatch_seen) {
        return false;
    }
    if (s_last_response_type == response_type) {
        return s_last_result_code == ESP32_RESULT_OK;
    }
    return wait_for_response(response_type, timeout_ms);
}

static bool query_status_internal(uint32_t timeout_ms)
{
    return request_wait_response(ESP32_MSG_QUERY_STATUS_REQ, NULL, 0U, ESP32_MSG_STATUS_RESP, timeout_ms);
}

static void reset_link_state(void)
{
    s_tx_seq = 1U;
    s_last_rx_seq = 0U;
    s_session_epoch = 0U;
    s_last_tx_seq = 0U;
    s_last_response_type = ESP32_MSG_NOOP;
    s_last_result_code = ESP32_SPI_RESULT_PENDING;
    s_last_response_text[0] = '\0';
    s_last_event_type = 0U;
    s_last_event_result = ESP32_SPI_RESULT_PENDING;
    s_wifi_failed_seen = 0U;
    s_register_event_seen = 0U;
    s_register_result = ESP32_SPI_RESULT_PENDING;
    s_session_mismatch_seen = 0U;
    memset(&s_status, 0, sizeof(s_status));
}

static void esp32_hard_reset(void)
{
    printf("[ESP32SPI] hardware reset ESP32 via EN\r\n");
    HAL_GPIO_WritePin(ESP32_CS_GPIO_Port, ESP32_CS_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(ESP32_EN_GPIO_Port, ESP32_EN_Pin, GPIO_PIN_RESET);
    HAL_Delay(150U);
    HAL_GPIO_WritePin(ESP32_EN_GPIO_Port, ESP32_EN_Pin, GPIO_PIN_SET);
    HAL_Delay(2500U);
}

bool ESP32_SPI_EnsureReady(uint32_t timeout_ms)
{
    uint32_t start;
    uint8_t rx_type = ESP32_MSG_NOOP;

    if (!spi_op_lock()) {
        return false;
    }

    if (timeout_ms == 0U) {
        timeout_ms = ESP32_SPI_DEFAULT_TIMEOUT_MS;
    }

    HAL_GPIO_WritePin(ESP32_EN_GPIO_Port, ESP32_EN_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(ESP32_CS_GPIO_Port, ESP32_CS_Pin, GPIO_PIN_SET);

    if (s_session_epoch != 0U && s_status.ready != 0U) {
        spi_op_unlock();
        return true;
    }

    reset_link_state();
    esp32_hard_reset();
    start = HAL_GetTick();

    printf("\r\n[ESP32SPI] handshake start, wire_size=%u\r\n", (unsigned int)ESP32_SPI_FRAME_SIZE);
    printf("[ESP32SPI] pins: CS=%u READY=%u EN=%u\r\n",
           (unsigned int)HAL_GPIO_ReadPin(ESP32_CS_GPIO_Port, ESP32_CS_Pin),
           (unsigned int)HAL_GPIO_ReadPin(ESP32_READY_GPIO_Port, ESP32_READY_Pin),
           (unsigned int)HAL_GPIO_ReadPin(ESP32_EN_GPIO_Port, ESP32_EN_Pin));

    if (!transact_and_handle_payload(ESP32_MSG_HELLO_REQ, NULL, 0U, &rx_type)) {
        printf("[ESP32SPI] HELLO transaction failed\r\n");
        spi_op_unlock();
        return false;
    }

    while (s_session_epoch == 0U && (HAL_GetTick() - start) < timeout_ms) {
        HAL_Delay(20);
        if (!transact_and_handle_payload(ESP32_MSG_NOOP, NULL, 0U, &rx_type)) {
            spi_op_unlock();
            return false;
        }
    }

    if (s_session_epoch == 0U) {
        printf("[ESP32SPI] handshake timeout\r\n");
        spi_op_unlock();
        return false;
    }

    drain_pending_packets(2000U, 3U);
    (void)query_status_internal(1000U);
    printf("[ESP32SPI] ready, session=%lu\r\n", (unsigned long)s_session_epoch);
    spi_op_unlock();
    return true;
}

static bool last_failure_was_session_mismatch(void)
{
    return (s_session_mismatch_seen != 0U) ||
           (s_last_nack_reason == ESP32_NACK_SESSION_MISMATCH);
}

static bool recover_session_mismatch(const char *op_name)
{
    printf("[ESP32SPI] recover session mismatch before retry op=%s\r\n",
           op_name ? op_name : "unknown");
    reset_link_state();
    return ESP32_SPI_EnsureReady(ESP32_SPI_DEFAULT_TIMEOUT_MS);
}

static bool request_wait_response_session_retry(uint8_t request_type,
                                                const void *payload,
                                                uint16_t payload_len,
                                                uint8_t response_type,
                                                uint32_t timeout_ms)
{
    if (request_wait_response(request_type, payload, payload_len, response_type, timeout_ms)) {
        return true;
    }

