lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/ESP32SPI/esp32_spi_debug.c
    if (!last_failure_was_session_mismatch()) {
        return false;
    }

    if (!recover_session_mismatch(msg_name(request_type))) {
        return false;
    }

    return request_wait_response(request_type, payload, payload_len, response_type, timeout_ms);
}

bool ESP32_SPI_ApplyDeviceConfig(const char *ssid,
                                 const char *password,
                                 const char *server_host,
                                 uint16_t server_port,
                                 const char *node_id,
                                 const char *node_location,
                                 const char *hw_version)
{
    esp32_device_config_payload_t payload;
    bool ok;

    if (!ESP32_SPI_EnsureReady(ESP32_SPI_DEFAULT_TIMEOUT_MS)) {
        return false;
    }

    memset(&payload, 0, sizeof(payload));
    copy_text(payload.wifi_ssid, sizeof(payload.wifi_ssid), ssid);
    copy_text(payload.wifi_password, sizeof(payload.wifi_password), password);
    copy_text(payload.server_host, sizeof(payload.server_host), server_host);
    payload.server_port = server_port;
    copy_text(payload.node_id, sizeof(payload.node_id), node_id);
    copy_text(payload.node_location, sizeof(payload.node_location), node_location);
    copy_text(payload.hw_version, sizeof(payload.hw_version), hw_version);

    printf("[ESP32SPI] apply device cfg ssid=%s host=%s:%u node=%s\r\n",
           payload.wifi_ssid,
           payload.server_host,
           (unsigned int)payload.server_port,
           payload.node_id);

    if (!spi_op_lock()) {
        return false;
    }
    ok = request_wait_response_session_retry(ESP32_MSG_SET_DEVICE_CONFIG_REQ,
                                             &payload,
                                             (uint16_t)sizeof(payload),
                                             ESP32_MSG_SET_DEVICE_CONFIG_RESP,
                                             8000U);
    spi_op_unlock();
    return ok;
}

bool ESP32_SPI_ApplyCommParams(uint32_t heartbeat_ms,
                               uint32_t min_interval_ms,
                               uint32_t http_timeout_ms,
                               uint32_t reconnect_backoff_ms,
                               uint32_t downsample_step,
                               uint32_t upload_points,
                               uint32_t hardreset_sec,
                               uint32_t chunk_kb,
                               uint32_t chunk_delay_ms)
{
    esp32_comm_params_payload_t payload;
    bool ok;

    if (!ESP32_SPI_EnsureReady(ESP32_SPI_DEFAULT_TIMEOUT_MS)) {
        return false;
    }

    memset(&payload, 0, sizeof(payload));
    payload.heartbeat_ms = heartbeat_ms;
    payload.min_interval_ms = min_interval_ms;
    payload.http_timeout_ms = http_timeout_ms;
    payload.reconnect_backoff_ms = reconnect_backoff_ms;
    payload.downsample_step = downsample_step;
    payload.upload_points = upload_points;
    payload.hardreset_sec = hardreset_sec;
    payload.chunk_kb = chunk_kb;
    payload.chunk_delay_ms = chunk_delay_ms;

    printf("[ESP32SPI] apply comm hb=%lums min=%lums http=%lums step=%lu points=%lu\r\n",
           (unsigned long)heartbeat_ms,
           (unsigned long)min_interval_ms,
           (unsigned long)http_timeout_ms,
           (unsigned long)downsample_step,
           (unsigned long)upload_points);

    if (!spi_op_lock()) {
        return false;
    }
    ok = request_wait_response_session_retry(ESP32_MSG_SET_COMM_PARAMS_REQ,
                                             &payload,
                                             (uint16_t)sizeof(payload),
                                             ESP32_MSG_SET_COMM_PARAMS_RESP,
                                             5000U);
    spi_op_unlock();
    return ok;
}

bool ESP32_SPI_QueryStatus(esp32_spi_status_t *out_status, uint32_t timeout_ms)
{
    bool ok;

    if (!ESP32_SPI_EnsureReady(ESP32_SPI_DEFAULT_TIMEOUT_MS)) {
        return false;
    }
    if (!spi_op_lock()) {
        return false;
    }
    ok = query_status_internal(timeout_ms == 0U ? 1000U : timeout_ms);
    if (!ok) {
        if (!last_failure_was_session_mismatch() ||
            !recover_session_mismatch("QUERY_STATUS_REQ") ||
            !query_status_internal(timeout_ms == 0U ? 1000U : timeout_ms)) {
            spi_op_unlock();
            return false;
        }
    }
    if (out_status != NULL) {
        *out_status = s_status;
    }
    spi_op_unlock();
    return true;
}

const esp32_spi_status_t *ESP32_SPI_GetStatus(void)
{
    return &s_status;
}

bool ESP32_SPI_PollEvents(uint32_t timeout_ms)
{
    bool ok;

    if (!spi_op_lock()) {
        return false;
    }
    ok = poll_noop(timeout_ms);
    spi_op_unlock();
    return ok;
}

uint32_t ESP32_SPI_GetLastTxSeq(void)
{
    return s_last_tx_seq;
}

uint32_t ESP32_SPI_GetLastFullEndRefSeq(void)
{
    return s_last_report_full_end_ref_seq;
}

uint32_t ESP32_SPI_GetLastNackRefSeq(void)
{
    return s_last_nack_ref_seq;
}

uint16_t ESP32_SPI_GetLastNackReason(void)
{
    return s_last_nack_reason;
}

bool ESP32_SPI_ConsumeServerCommand(uint8_t *out_reset,
                                    uint8_t *out_has_report_mode,
                                    uint8_t *out_report_full,
                                    uint8_t *out_has_downsample_step,
                                    uint32_t *out_downsample_step,
                                    uint8_t *out_has_upload_points,
                                    uint32_t *out_upload_points,
                                    uint8_t *out_has_heartbeat_ms,
                                    uint32_t *out_heartbeat_ms,
                                    uint8_t *out_has_min_interval_ms,
                                    uint32_t *out_min_interval_ms,
                                    uint8_t *out_has_http_timeout_ms,
                                    uint32_t *out_http_timeout_ms,
                                    uint8_t *out_has_chunk_kb,
                                    uint32_t *out_chunk_kb,
                                    uint8_t *out_has_chunk_delay_ms,
                                    uint32_t *out_chunk_delay_ms)
{
    uint8_t has_any = (s_pending_server_reset ||
                       s_pending_server_report_mode_valid ||
                       s_pending_server_downsample_valid ||
                       s_pending_server_upload_valid ||
                       s_pending_server_heartbeat_valid ||
                       s_pending_server_min_interval_valid ||
                       s_pending_server_http_timeout_valid ||
                       s_pending_server_chunk_kb_valid ||
                       s_pending_server_chunk_delay_valid) ? 1U : 0U;

    if (out_reset != NULL) {
        *out_reset = s_pending_server_reset;
    }
    if (out_has_report_mode != NULL) {
        *out_has_report_mode = s_pending_server_report_mode_valid;
    }
    if (out_report_full != NULL) {
        *out_report_full = s_pending_server_report_full;
    }
    if (out_has_downsample_step != NULL) {
        *out_has_downsample_step = s_pending_server_downsample_valid;
    }
    if (out_downsample_step != NULL) {
        *out_downsample_step = s_pending_server_downsample_step;
    }
    if (out_has_upload_points != NULL) {
        *out_has_upload_points = s_pending_server_upload_valid;
    }
    if (out_upload_points != NULL) {
        *out_upload_points = s_pending_server_upload_points;
    }
    if (out_has_heartbeat_ms != NULL) {
        *out_has_heartbeat_ms = s_pending_server_heartbeat_valid;
    }
    if (out_heartbeat_ms != NULL) {
        *out_heartbeat_ms = s_pending_server_heartbeat_ms;
    }
    if (out_has_min_interval_ms != NULL) {
        *out_has_min_interval_ms = s_pending_server_min_interval_valid;
    }
    if (out_min_interval_ms != NULL) {
        *out_min_interval_ms = s_pending_server_min_interval_ms;
    }
    if (out_has_http_timeout_ms != NULL) {
        *out_has_http_timeout_ms = s_pending_server_http_timeout_valid;
    }
    if (out_http_timeout_ms != NULL) {
        *out_http_timeout_ms = s_pending_server_http_timeout_ms;
    }
    if (out_has_chunk_kb != NULL) {
        *out_has_chunk_kb = s_pending_server_chunk_kb_valid;
    }
    if (out_chunk_kb != NULL) {
        *out_chunk_kb = s_pending_server_chunk_kb;
    }
    if (out_has_chunk_delay_ms != NULL) {
        *out_has_chunk_delay_ms = s_pending_server_chunk_delay_valid;
    }
    if (out_chunk_delay_ms != NULL) {
        *out_chunk_delay_ms = s_pending_server_chunk_delay_ms;
    }

