lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/ESP32SPI/esp32_spi_debug.c
    s_pending_server_reset = 0U;
    s_pending_server_report_mode_valid = 0U;
    s_pending_server_downsample_valid = 0U;
    s_pending_server_upload_valid = 0U;
    s_pending_server_heartbeat_valid = 0U;
    s_pending_server_min_interval_valid = 0U;
    s_pending_server_http_timeout_valid = 0U;
    s_pending_server_chunk_kb_valid = 0U;
    s_pending_server_chunk_delay_valid = 0U;
    return has_any != 0U;
}

bool ESP32_SPI_GetTxResult(uint32_t ref_seq,
                           int32_t *out_http_status,
                           int32_t *out_result_code,
                           uint32_t *out_frame_id)
{
    if (ref_seq == 0U || s_last_tx_result_ref_seq != ref_seq) {
        return false;
    }
    if (out_http_status != NULL) {
        *out_http_status = s_last_tx_result_http_status;
    }
    if (out_result_code != NULL) {
        *out_result_code = s_last_tx_result_code;
    }
    if (out_frame_id != NULL) {
        *out_frame_id = s_last_tx_result_frame_id;
    }
    return true;
}

bool ESP32_SPI_ConnectWifi(uint32_t timeout_ms)
{
    uint32_t start;

    if (!ESP32_SPI_EnsureReady(ESP32_SPI_DEFAULT_TIMEOUT_MS)) {
        return false;
    }
    if (!spi_op_lock()) {
        return false;
    }

    s_wifi_failed_seen = 0U;
    if (!request_wait_response_session_retry(ESP32_MSG_CONNECT_REQ, NULL, 0U, ESP32_MSG_CONNECT_RESP, 3000U)) {
        spi_op_unlock();
        return false;
    }

    start = HAL_GetTick();
    while ((HAL_GetTick() - start) < timeout_ms) {
        if (s_status.wifi_connected) {
            (void)query_status_internal(500U);
            spi_op_unlock();
            return true;
        }
        if (s_wifi_failed_seen) {
            (void)query_status_internal(500U);
            spi_op_unlock();
            return false;
        }
        HAL_Delay(ESP32_SPI_WIFI_POLL_INTERVAL_MS);
        (void)query_status_internal(800U);
        if (s_status.wifi_connected) {
            spi_op_unlock();
            return true;
        }
        if (s_wifi_failed_seen) {
            spi_op_unlock();
            return false;
        }
    }

    printf("[ESP32SPI] WiFi connect timeout, last_error=%s\r\n", s_status.last_error);
    spi_op_unlock();
    return false;
}

bool ESP32_SPI_CloudConnect(uint32_t timeout_ms)
{
    bool ok;

    (void)timeout_ms;
    if (!ESP32_SPI_EnsureReady(ESP32_SPI_DEFAULT_TIMEOUT_MS)) {
        return false;
    }
    if (!spi_op_lock()) {
        return false;
    }
    if (!request_wait_response_session_retry(ESP32_MSG_CLOUD_CONNECT_REQ, NULL, 0U, ESP32_MSG_CLOUD_CONNECT_RESP, 3000U)) {
        (void)query_status_internal(500U);
        spi_op_unlock();
        return false;
    }
    (void)query_status_internal(500U);
    ok = s_status.cloud_connected || s_status.wifi_connected;
    spi_op_unlock();
    return ok;
}

bool ESP32_SPI_RegisterNode(uint32_t timeout_ms)
{
    uint32_t start;

    if (!ESP32_SPI_EnsureReady(ESP32_SPI_DEFAULT_TIMEOUT_MS)) {
        return false;
    }
    if (!spi_op_lock()) {
        return false;
    }

    s_register_event_seen = 0U;
    s_register_result = ESP32_SPI_RESULT_PENDING;
    if (!request_wait_response_session_retry(ESP32_MSG_REGISTER_REQ, NULL, 0U, ESP32_MSG_REGISTER_RESP, 3000U)) {
        (void)query_status_internal(500U);
        spi_op_unlock();
        return false;
    }

    start = HAL_GetTick();
    while ((HAL_GetTick() - start) < timeout_ms) {
        if (s_status.registered_with_cloud) {
            spi_op_unlock();
            return true;
        }
        if (s_register_event_seen) {
            bool ok = (s_register_result == ESP32_RESULT_OK);
            spi_op_unlock();
            return ok;
        }
        (void)query_status_internal(600U);
        if (s_status.registered_with_cloud) {
            spi_op_unlock();
            return true;
        }
        if (s_register_event_seen) {
            bool ok = (s_register_result == ESP32_RESULT_OK);
            spi_op_unlock();
            return ok;
        }
        HAL_Delay(100);
    }

    printf("[ESP32SPI] register timeout, http=%ld err=%s\r\n",
           (long)s_status.last_http_status,
           s_status.last_error);
    spi_op_unlock();
    return false;
}

bool ESP32_SPI_StartReport(uint8_t report_mode, uint32_t timeout_ms)
{
    esp32_start_report_payload_t payload;
    bool ok;

    (void)timeout_ms;
    if (!ESP32_SPI_EnsureReady(ESP32_SPI_DEFAULT_TIMEOUT_MS)) {
        return false;
    }
    if (!spi_op_lock()) {
        return false;
    }

    memset(&payload, 0, sizeof(payload));
    payload.report_mode = report_mode ? 1U : 0U;

    if (!request_wait_response_session_retry(ESP32_MSG_START_REPORT_REQ,
                                             &payload,
                                             (uint16_t)sizeof(payload),
                                             ESP32_MSG_START_REPORT_RESP,
                                             3000U)) {
        (void)query_status_internal(500U);
        spi_op_unlock();
        return false;
    }
    (void)query_status_internal(500U);
    ok = (s_status.reporting_enabled != 0U);
    spi_op_unlock();
    return ok;
}

bool ESP32_SPI_StopReport(uint32_t timeout_ms)
{
    bool ok;

    (void)timeout_ms;
    if (!ESP32_SPI_EnsureReady(ESP32_SPI_DEFAULT_TIMEOUT_MS)) {
        return false;
    }
    if (!spi_op_lock()) {
        return false;
    }
    if (!request_wait_response_session_retry(ESP32_MSG_STOP_REPORT_REQ, NULL, 0U, ESP32_MSG_STOP_REPORT_RESP, 3000U)) {
        (void)query_status_internal(500U);
        spi_op_unlock();
        return false;
    }
    (void)query_status_internal(500U);
    ok = true;
    spi_op_unlock();
    return ok;
}

bool ESP32_SPI_ReportSummary(uint32_t frame_id,
                             uint64_t timestamp_ms,
                             uint32_t downsample_step,
                             uint32_t upload_points,
                             const char *fault_code,
                             uint8_t report_mode,
                             uint8_t status_code,
                             const esp32_spi_report_channel_t *channels,
                             uint8_t channel_count,
                             uint32_t timeout_ms)
{
    esp32_report_summary_payload_t payload;
    uint32_t ref_seq;
    uint32_t start;

    if (channels == NULL || channel_count == 0U || channel_count > 4U) {
        return false;
    }
    if (!ESP32_SPI_EnsureReady(ESP32_SPI_DEFAULT_TIMEOUT_MS)) {
        return false;
    }
    if (!spi_op_lock()) {
        return false;
    }

    memset(&payload, 0, sizeof(payload));
    payload.frame_id = frame_id;
    payload.timestamp_ms = timestamp_ms;
    payload.downsample_step = downsample_step;
    payload.upload_points = upload_points;
    copy_text(payload.fault_code, sizeof(payload.fault_code), fault_code ? fault_code : "E00");
    payload.report_mode = report_mode ? 1U : 0U;
    payload.status_code = status_code;
    payload.channel_count = channel_count;
    for (uint8_t i = 0; i < channel_count; i++) {
        payload.channels[i].channel_id = channels[i].channel_id;
        payload.channels[i].waveform_count = channels[i].waveform_count;
        payload.channels[i].fft_count = channels[i].fft_count;
        payload.channels[i].value_scaled = channels[i].value_scaled;
        payload.channels[i].current_value_scaled = channels[i].current_value_scaled;
    }

    s_last_tx_accepted_ref_seq = 0U;
    s_last_tx_result_ref_seq = 0U;
    s_last_tx_result_code = ESP32_SPI_RESULT_PENDING;
    s_last_tx_result_http_status = 0;
    s_last_tx_result_frame_id = 0U;
    s_last_nack_ref_seq = 0U;
    s_last_nack_reason = 0U;

    if (!transact_and_handle_payload(ESP32_MSG_REPORT_SUMMARY,
                                     &payload,
                                     (uint16_t)sizeof(payload),
                                     NULL)) {
        spi_op_unlock();
        return false;
    }

    ref_seq = s_last_tx_seq;
    start = HAL_GetTick();
    while ((HAL_GetTick() - start) < timeout_ms) {
        if (s_last_tx_accepted_ref_seq == ref_seq) {
            spi_op_unlock();
            return true;
        }
        if (s_last_tx_result_ref_seq == ref_seq) {
            bool ok = (s_last_tx_result_code == ESP32_RESULT_OK);
            spi_op_unlock();
            return ok;
        }
        if (s_last_nack_ref_seq == ref_seq) {
            if (!nack_reason_is_retryable(s_last_nack_reason) || ESP32_SPI_LOG_RETRYABLE_NACKS) {
                printf("[ESP32SPI] summary NACK reason=%u\r\n", (unsigned int)s_last_nack_reason);
            }
            spi_op_unlock();
            return false;
        }
        if (!poll_noop(40U)) {
            spi_op_unlock();
            return false;
        }
    }

