lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/ESP32SPI/esp32_spi_debug.c
    printf("[ESP32SPI] summary accepted timeout frame=%lu ref=%lu\r\n",
           (unsigned long)frame_id,
           (unsigned long)ref_seq);
    spi_op_unlock();
    return false;
}

#if (ESP32_SPI_ENABLE_FULL_UPLOAD)
static int32_t scale_float_to_i32(float v, float scale)
{
    double x;

    if (!(v == v) || v > 1.0e20f || v < -1.0e20f) {
        return 0;
    }
    x = (double)v * (double)scale;
    if (x > 2147483647.0) {
        return 2147483647;
    }
    if (x < -2147483648.0) {
        return (int32_t)0x80000000UL;
    }
    return (int32_t)((x >= 0.0) ? (x + 0.5) : (x - 0.5));
}

static int16_t scale_float_to_i16(float v, float scale)
{
    double x;

    if (!(v == v) || v > 1.0e20f || v < -1.0e20f) {
        return 0;
    }
    x = (double)v * (double)scale;
    if (x > 32767.0) {
        return 32767;
    }
    if (x < -32768.0) {
        return (int16_t)-32768;
    }
    return (int16_t)((x >= 0.0) ? (x + 0.5) : (x - 0.5));
}

static bool wait_report_packet_accepted(uint32_t frame_id, uint32_t ref_seq, uint32_t timeout_ms, const char *label)
{
    uint32_t start = HAL_GetTick();

    while ((HAL_GetTick() - start) < timeout_ms) {
        if (s_last_tx_accepted_ref_seq == ref_seq) {
            return true;
        }
        if (s_last_tx_result_ref_seq == ref_seq) {
            return s_last_tx_result_code == ESP32_RESULT_OK;
        }
        if (s_last_nack_ref_seq == ref_seq) {
            if (!nack_reason_is_retryable(s_last_nack_reason) || ESP32_SPI_LOG_RETRYABLE_NACKS) {
                printf("[ESP32SPI] full %s NACK frame=%lu ref=%lu reason=%u\r\n",
                       label ? label : "packet",
                       (unsigned long)frame_id,
                       (unsigned long)ref_seq,
                       (unsigned int)s_last_nack_reason);
            }
            return false;
        }
        if (!poll_noop(40U)) {
            return false;
        }
    }

    printf("[ESP32SPI] full %s accepted timeout frame=%lu ref=%lu\r\n",
           label ? label : "packet",
           (unsigned long)frame_id,
           (unsigned long)ref_seq);
    return false;
}

static bool report_nack_is_retryable(uint32_t ref_seq)
{
    if (s_last_nack_ref_seq != ref_seq) {
        return true;
    }
    return nack_reason_is_retryable(s_last_nack_reason);
}

static bool nack_reason_is_retryable(uint16_t reason)
{
    return (reason == ESP32_NACK_CRC_FAIL ||
            reason == ESP32_NACK_BAD_LENGTH);
}

static void log_report_accept_retry(const char *label,
                                    uint32_t frame_id,
                                    uint32_t ref_seq,
                                    uint8_t attempt)
{
#if ESP32_SPI_LOG_RETRYABLE_NACKS
    printf("[ESP32SPI] full %s accepted retry frame=%lu ref=%lu reason=%u attempt=%u\r\n",
           label ? label : "packet",
           (unsigned long)frame_id,
           (unsigned long)ref_seq,
           (unsigned int)((s_last_nack_ref_seq == ref_seq) ? s_last_nack_reason : 0U),
           (unsigned int)(attempt + 1U));
#else
    (void)label;
    (void)frame_id;
    (void)ref_seq;
    (void)attempt;
#endif
}

static void report_retry_backoff(uint32_t ref_seq)
{
    if (s_last_nack_ref_seq != ref_seq) {
        return;
    }
    if (s_last_nack_reason == ESP32_NACK_CRC_FAIL ||
        s_last_nack_reason == ESP32_NACK_BAD_LENGTH) {
        wait_ready_release(ESP32_SPI_READY_RELEASE_TIMEOUT_MS);
        HAL_Delay(ESP32_SPI_REPORT_RETRY_BACKOFF_MS);
    }
}

static bool send_report_packet_wait(uint8_t msg_type,
                                    const void *payload,
                                    uint16_t payload_len,
                                    uint32_t frame_id,
                                    uint32_t timeout_ms,
                                    const char *label)
{
    uint32_t ref_seq;
    uint32_t recover_timeout = (timeout_ms < 150U) ? timeout_ms : 150U;

    if (!spi_op_lock()) {
        return false;
    }

    for (uint8_t attempt = 0U; attempt < ESP32_SPI_REPORT_RETRY_ATTEMPTS; attempt++) {
        s_last_tx_accepted_ref_seq = 0U;
        s_last_tx_result_ref_seq = 0U;
        s_last_tx_result_code = ESP32_SPI_RESULT_PENDING;
        s_last_tx_result_http_status = 0;
        s_last_tx_result_frame_id = 0U;
        s_last_nack_ref_seq = 0U;
        s_last_nack_reason = 0U;

        if (transact_and_handle_payload(msg_type, payload, payload_len, NULL)) {
            ref_seq = s_last_tx_seq;
            if (wait_report_packet_accepted(frame_id, ref_seq, timeout_ms, label)) {
                if (msg_type == ESP32_MSG_REPORT_FULL_END) {
                    s_last_report_full_end_ref_seq = ref_seq;
                }
                spi_op_unlock();
                return true;
            }
            if (msg_type == ESP32_MSG_REPORT_FULL_END &&
                s_last_nack_ref_seq != ref_seq) {
                s_last_report_full_end_ref_seq = ref_seq;
                printf("[ESP32SPI] full end accept missing; wait result frame=%lu ref=%lu\r\n",
                       (unsigned long)frame_id,
                       (unsigned long)ref_seq);
                spi_op_unlock();
                return true;
            }
            if (!report_nack_is_retryable(ref_seq)) {
                spi_op_unlock();
                return false;
            }
            report_retry_backoff(ref_seq);
            if (attempt + 1U < ESP32_SPI_REPORT_RETRY_ATTEMPTS) {
                log_report_accept_retry(label, frame_id, ref_seq, attempt);
                continue;
            }
            spi_op_unlock();
            return false;
        }

        ref_seq = s_last_tx_seq;
        if (ref_seq != 0U && recover_timeout != 0U &&
            wait_report_packet_accepted(frame_id, ref_seq, recover_timeout, label)) {
            if (msg_type == ESP32_MSG_REPORT_FULL_END) {
                s_last_report_full_end_ref_seq = ref_seq;
            }
            spi_op_unlock();
            return true;
        }
        printf("[ESP32SPI] full %s transaction retry frame=%lu attempt=%u\r\n",
               label ? label : "packet",
               (unsigned long)frame_id,
               (unsigned int)(attempt + 1U));
    }
    spi_op_unlock();
    return false;
}

static bool send_report_built_packet_wait(uint8_t msg_type,
                                          uint16_t payload_len,
                                          esp32_spi_payload_builder_t builder,
                                          void *builder_ctx,
                                          uint32_t frame_id,
                                          uint32_t timeout_ms,
                                          const char *label)
{
    uint32_t ref_seq;
    uint32_t recover_timeout = (timeout_ms < 150U) ? timeout_ms : 150U;

