lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/ESP32SPI/esp32_spi_debug.c
    if (!spi_op_lock()) {
        return false;
    }

    for (uint8_t attempt = 0U; attempt < ESP32_SPI_REPORT_RETRY_ATTEMPTS; attempt++) {
        s_last_tx_accepted_ref_seq = 0U;
        s_last_tx_result_ref_seq = 0U;
        s_last_tx_result_code = ESP32_SPI_RESULT_PENDING;
        s_last_tx_result_http_status = 0;
        s_last_tx_result_frame_id = 0U;
        s_last_nack_ref_seq = 0U;
        s_last_nack_reason = 0U;

        if (transact_and_handle_built_payload(msg_type, payload_len, builder, builder_ctx, NULL)) {
            ref_seq = s_last_tx_seq;
            if (wait_report_packet_accepted(frame_id, ref_seq, timeout_ms, label)) {
                spi_op_unlock();
                return true;
            }
            if (!report_nack_is_retryable(ref_seq)) {
                spi_op_unlock();
                return false;
            }
            report_retry_backoff(ref_seq);
            if (attempt + 1U < ESP32_SPI_REPORT_RETRY_ATTEMPTS) {
                log_report_accept_retry(label, frame_id, ref_seq, attempt);
                continue;
            }
            spi_op_unlock();
            return false;
        }

        ref_seq = s_last_tx_seq;
        if (ref_seq != 0U && recover_timeout != 0U &&
            wait_report_packet_accepted(frame_id, ref_seq, recover_timeout, label)) {
            spi_op_unlock();
            return true;
        }
        printf("[ESP32SPI] full %s transaction retry frame=%lu attempt=%u\r\n",
               label ? label : "packet",
               (unsigned long)frame_id,
               (unsigned int)(attempt + 1U));
    }
    spi_op_unlock();
    return false;
}

typedef struct {
    uint32_t frame_id;
    uint8_t channel_id;
    uint16_t element_offset;
    uint16_t element_count;
    uint32_t source_step;
    uint16_t source_count;
    const float *values;
} esp32_full_chunk_builder_ctx_t;

static bool build_wave_chunk_payload(uint8_t *payload, uint16_t payload_len, void *ctx)
{
    const esp32_full_chunk_builder_ctx_t *chunk = (const esp32_full_chunk_builder_ctx_t *)ctx;
    esp32_report_chunk_prefix_t prefix;
    uint32_t expected_len;

    if (payload == NULL || chunk == NULL || chunk->values == NULL) {
        return false;
    }
    expected_len = (uint32_t)sizeof(prefix) + ((uint32_t)chunk->element_count * sizeof(int16_t));
    if (payload_len != (uint16_t)expected_len) {
        return false;
    }

    memset(&prefix, 0, sizeof(prefix));
    prefix.frame_id = chunk->frame_id;
    prefix.channel_id = chunk->channel_id;
    prefix.element_offset = chunk->element_offset;
    prefix.element_count = chunk->element_count;
    memcpy(payload, &prefix, sizeof(prefix));

    for (uint16_t i = 0U; i < chunk->element_count; i++) {
        uint32_t step = (chunk->source_step == 0U) ? 1U : chunk->source_step;
        uint32_t src_index = (((uint32_t)chunk->element_offset + (uint32_t)i) * step);
        if (chunk->source_count == 0U || src_index >= (uint32_t)chunk->source_count) {
            return false;
        }
        int16_t scaled = scale_float_to_i16(chunk->values[src_index], EW_UPLOAD_WAVEFORM_SCALE);
        memcpy(payload + sizeof(prefix) + ((uint32_t)i * sizeof(scaled)), &scaled, sizeof(scaled));
    }
    return true;
}

static bool build_fft_chunk_payload(uint8_t *payload, uint16_t payload_len, void *ctx)
{
    const esp32_full_chunk_builder_ctx_t *chunk = (const esp32_full_chunk_builder_ctx_t *)ctx;
    esp32_report_chunk_prefix_t prefix;
    uint32_t expected_len;

    if (payload == NULL || chunk == NULL || chunk->values == NULL) {
        return false;
    }
    expected_len = (uint32_t)sizeof(prefix) + ((uint32_t)chunk->element_count * sizeof(int16_t));
    if (payload_len != (uint16_t)expected_len) {
        return false;
    }

    memset(&prefix, 0, sizeof(prefix));
    prefix.frame_id = chunk->frame_id;
    prefix.channel_id = chunk->channel_id;
    prefix.element_offset = chunk->element_offset;
    prefix.element_count = chunk->element_count;
    memcpy(payload, &prefix, sizeof(prefix));

    for (uint16_t i = 0U; i < chunk->element_count; i++) {
        uint32_t src_index = (uint32_t)chunk->element_offset + (uint32_t)i;
        if (chunk->source_count == 0U || src_index >= (uint32_t)chunk->source_count) {
            return false;
        }
        int16_t scaled = scale_float_to_i16(chunk->values[src_index], EW_UPLOAD_FFT_SCALE);
        memcpy(payload + sizeof(prefix) + ((uint32_t)i * sizeof(scaled)), &scaled, sizeof(scaled));
    }
    return true;
}

static bool send_wave_chunks(uint32_t frame_id,
                             uint8_t channel_id,
                             const float *waveform,
                             uint16_t waveform_count,
                             uint32_t timeout_ms)
{
    const uint16_t max_elements =
        (uint16_t)((ESP32_SPI_MAX_PAYLOAD - sizeof(esp32_report_chunk_prefix_t)) / sizeof(int16_t));
    uint16_t offset = 0U;

    while (offset < waveform_count) {
        uint16_t count = (uint16_t)(waveform_count - offset);
        esp32_full_chunk_builder_ctx_t chunk;
        uint16_t payload_len;

        if (count > max_elements) {
            count = max_elements;
        }
        chunk.frame_id = frame_id;
        chunk.channel_id = channel_id;
        chunk.element_offset = offset;
        chunk.element_count = count;
        chunk.source_step = 1U;
        chunk.source_count = waveform_count;
        chunk.values = waveform;

        payload_len = (uint16_t)(sizeof(esp32_report_chunk_prefix_t) + ((uint32_t)count * sizeof(int16_t)));
        if (!send_report_built_packet_wait(ESP32_MSG_REPORT_FULL_WAVE_CHUNK,
                                           payload_len,
                                           build_wave_chunk_payload,
                                           &chunk,
                                           frame_id,
                                           timeout_ms,
                                           "wave")) {
            return false;
        }
        offset = (uint16_t)(offset + count);
    }
    return true;
}

static bool send_fft_chunks(uint32_t frame_id,
                            uint8_t channel_id,
                            const float *fft,
                            uint16_t fft_count,
                            uint32_t timeout_ms)
{
    const uint16_t max_elements =
        (uint16_t)((ESP32_SPI_MAX_PAYLOAD - sizeof(esp32_report_chunk_prefix_t)) / sizeof(int16_t));
    uint16_t offset = 0U;

    while (offset < fft_count) {
        uint16_t count = (uint16_t)(fft_count - offset);
        esp32_full_chunk_builder_ctx_t chunk;
        uint16_t payload_len;

        if (count > max_elements) {
            count = max_elements;
        }
        chunk.frame_id = frame_id;
        chunk.channel_id = channel_id;
        chunk.element_offset = offset;
        chunk.element_count = count;
        chunk.source_step = 1U;
        chunk.source_count = fft_count;
        chunk.values = fft;

        payload_len = (uint16_t)(sizeof(esp32_report_chunk_prefix_t) + ((uint32_t)count * sizeof(int16_t)));
        if (!send_report_built_packet_wait(ESP32_MSG_REPORT_FULL_FFT_CHUNK,
                                           payload_len,
                                           build_fft_chunk_payload,
                                           &chunk,
                                           frame_id,
                                           timeout_ms,
                                           "fft")) {
            return false;
        }
        offset = (uint16_t)(offset + count);
    }
    return true;
}

