lin-han-li/Edge_Wind-STM32H7-FreeRTOS-LVGL-ESP32/STM32H7+FreeRTOS+LVGL+ESP32/MDK-ARM/HARDWORK/ESP32SPI/esp32_spi_debug.c
bool ESP32_SPI_ReportFull(uint32_t frame_id,
                          uint64_t timestamp_ms,
                          uint32_t downsample_step,
                          uint32_t upload_points,
                          const char *fault_code,
                          uint8_t status_code,
                          const esp32_spi_report_channel_t *channels,
                          uint8_t channel_count,
                          const float * const waveforms[],
                          const float * const ffts[],
                          uint16_t waveform_count,
                          uint16_t fft_count,
                          uint32_t timeout_ms)
{
    esp32_report_full_begin_payload_t begin;
    esp32_report_end_payload_t end_payload;
    uint32_t per_packet_timeout = (timeout_ms == 0U) ? 1500U : timeout_ms;

    if (channels == NULL || waveforms == NULL || ffts == NULL ||
        channel_count == 0U || channel_count > 4U) {
        return false;
    }
    s_last_report_full_end_ref_seq = 0U;
    if (!ESP32_SPI_EnsureReady(ESP32_SPI_DEFAULT_TIMEOUT_MS)) {
        return false;
    }

    memset(&begin, 0, sizeof(begin));
    begin.frame_id = frame_id;
    begin.timestamp_ms = timestamp_ms;
    begin.downsample_step = downsample_step;
    begin.upload_points = upload_points;
    copy_text(begin.fault_code, sizeof(begin.fault_code), fault_code ? fault_code : "E00");
    begin.report_mode = 1U;
    begin.status_code = status_code;
    begin.channel_count = channel_count;

    for (uint8_t i = 0U; i < channel_count; i++) {
        if (waveforms[i] == NULL || ffts[i] == NULL ||
            channels[i].waveform_count > waveform_count ||
            channels[i].fft_count > fft_count) {
            return false;
        }
        begin.channels[i].channel_id = channels[i].channel_id;
        begin.channels[i].waveform_count = channels[i].waveform_count;
        begin.channels[i].fft_count = channels[i].fft_count;
        begin.channels[i].value_scaled = channels[i].value_scaled;
        begin.channels[i].current_value_scaled = channels[i].current_value_scaled;
    }

    if (!send_report_packet_wait(ESP32_MSG_REPORT_FULL_BEGIN,
                                 &begin,
                                 (uint16_t)sizeof(begin),
                                 frame_id,
                                 per_packet_timeout,
                                 "begin")) {
        return false;
    }

    for (uint8_t i = 0U; i < channel_count; i++) {
        if (!send_wave_chunks(frame_id,
                              channels[i].channel_id,
                              waveforms[i],
                              channels[i].waveform_count,
                              per_packet_timeout)) {
            return false;
        }
        if (!send_fft_chunks(frame_id,
                             channels[i].channel_id,
                             ffts[i],
                             channels[i].fft_count,
                             per_packet_timeout)) {
            return false;
        }
    }

    memset(&end_payload, 0, sizeof(end_payload));
    end_payload.frame_id = frame_id;
    return send_report_packet_wait(ESP32_MSG_REPORT_FULL_END,
                                   &end_payload,
                                   (uint16_t)sizeof(end_payload),
                                   frame_id,
                                   per_packet_timeout,
                                   "end");
}
#endif

void ESP32_SPI_DebugRunPing(void)
{
    bool got_ping = false;
    uint8_t rx_type = ESP32_MSG_NOOP;

    if (!ESP32_SPI_EnsureReady(3000U)) {
        printf("[ESP32SPI] debug ping FAIL: handshake\r\n");
        return;
    }

    if (!transact_and_handle_payload(ESP32_MSG_PING_REQ, NULL, 0U, &rx_type)) {
        printf("[ESP32SPI] PING transaction failed\r\n");
        return;
    }
    got_ping = (rx_type == ESP32_MSG_PING_RESP) ||
               (s_last_response_type == ESP32_MSG_PING_RESP && s_last_result_code == ESP32_RESULT_OK);

    for (uint32_t i = 0; i < 80U && !got_ping; i++) {
        HAL_Delay(10);
        if (!transact_and_handle_payload(ESP32_MSG_NOOP, NULL, 0U, &rx_type)) {
            printf("[ESP32SPI] PING poll failed\r\n");
            return;
        }
        got_ping = (rx_type == ESP32_MSG_PING_RESP) ||
                   (s_last_response_type == ESP32_MSG_PING_RESP && s_last_result_code == ESP32_RESULT_OK);
    }

    printf("[ESP32SPI] debug ping %s, session=%lu last_rx_seq=%lu\r\n",
           got_ping ? "PASS" : "FAIL",
           (unsigned long)s_session_epoch,
           (unsigned long)s_last_rx_seq);
}
